import codecs
import re

with open('app/index.html', 'r', encoding='utf-8') as f:
    text = f.read()

reps = {
    'â”€': '─',
    'â—\x8f': '●',
    'ðŸš«': '🚫',
    'âš‘': '⚐',
    '🔍\x8d': '🔍',
    '🔍„': '🔍',
    '📊Œ': '📊',
    'âˆ’': '−',
    'âœ“': '✓',
    '📊ˆ': '📊',
    '🔍—': '🔍',
    'Ã—': '×',
    'â\x8f¸ï¸\x8f': '⏸️',
    'âŸ¨': '⟨',
    '🛡°ï¸\x8f': '🛡️',
    'âœ—': '✗',
    'âš\xa0ï¸\x8f': '⚠️',
    '”¦': '…',
    '”“': '”',
    'â€“': '–',
    'Â·': '·',
    'âš¡': '⚡',
    'ðŸ›¡': '🛡️',
    'ðŸ¤–': '🤖',
    'âž¡': '➡',
    'âœ…': '✅',
    'ðŸ”Ž': '🔍',
    'ðŸ§': '🧠',
    'ðŸ“Š': '📊',
    'â†’': '→',
    'âœ–': '✖',
    'ðŸš§': '🚧',
    'â‡¤': '⇤',
    'ðŸ’°': '💰',
    'â€œ': '“',
    'â€': '”',
    'â€˜': '‘',
    'â€™': '’',
    'Ã°Ÿ›¡ï¸': '🛡️',
    'Ã¢â‚¬â€': '—',
    'Ã¢Å¡Â¡': '⚡',
    'Ã°Ÿ”Ž': '🔍',
    'Ã°Ÿ§': '🧠',
    'Ã°Ÿ“Š': '📊',
    'Ã¢â€¡¤': '⇤',
    'Ã¢Å“â€¦': '✅'
}

count = 0
for k, v in reps.items():
    if k in text:
        count += text.count(k)
        text = text.replace(k, v)

with open('app/index.html', 'w', encoding='utf-8') as f:
    f.write(text)

print(f'Made {count} extra replacements.')
